#include <iostream>
using namespace std;


    /*ТЕМА: OPERATORS OVERLOADING
Завдання 1 :
    Створити клас Airplane(літак), який буде мати наступні характеристики :
• Модель
• Тип
• Кількість пасажирів
• Максимальна кількість пасажирів
За допомогою перевантаження операторів реалізувати :
1. Перевірку на рівність типів літаків(операція == ) friend
2. Збільшення і зменшення пасажирів в салоні літака(операції ++ та --
    в префіксній формі)
    3. Порівняння двох літаків по максимально можливій кількості пасажирів
    на борту(операція > ) friend
    4. Збільшити кількість пасажирів на певне значення(оператор(15))
    Перевантаження логічних операцій виконати за допомогою дружніх функцій.
    При виконанні операцій, потрібно перевіряти чи не перебільшено максимальну
    кількість пасажирів.
    !Результат завантажити у вигляді.cpp файла.*/








int main()
{
    
}
