
#include <iostream>
using namespace std;

    /*Завдання 1. Використовуючи покажчики й оператор
    розіменування, визначити найбільше з двох чисел.*/

int* more(int* a, int* b) {return ((*a) > (*b)) ? a : b;}

    /*Завдання 2. Використовуючи покажчики й оператор розі -
    менування, визначити знак числа, введеного з клавіатури.*/

void positiveOrNegative(int* a) {
    if (*a>=0)
    {
        cout << "Number is positive" << endl;
    }
    else
    {
        cout << "Number is negative" << endl;
    }
}

/*Завдання 3. Використовуючи покажчики й оператор роз -
        іменування, поміняти місцями значення двох змінних.*/

void changeVars(int* a, int* b) {
    int temp = *a;
    *a = *b;
    *b = temp;
}

/*Завдання 4. Написати примітивний калькулятор, кори -
    стуючись тільки покажчиками.*/







int main()
{
    /*Завдання 1. Використовуючи покажчики й оператор
    розіменування, визначити найбільше з двох чисел.*/

    /*int a = 5, b = 10;
    cout << *(more(&a, &b)) << endl;*/

    /*Завдання 2. Використовуючи покажчики й оператор розі -
        менування, визначити знак числа, введеного з клавіатури.*/


    /*cout << "enter number: " << endl;
    int c;
    cin >> c;
    positiveornegative(&c);*/

    /*Завдання 3. Використовуючи покажчики й оператор роз -
        іменування, поміняти місцями значення двох змінних.*/


    /*int a = 5, b = 10;
    cout << "a= " << a << " b= " << b << endl;
    changeVars(&a, &b);
    cout << "a= " << a << " b= " << b << endl;*/

    /*Завдання 4. Написати примітивний калькулятор, кори -
        стуючись тільки покажчиками.*/


    
}

