
#include <iostream>
using namespace std;

    /*Завдання 1. Використовуючи покажчики й оператор
    розіменування, визначити найбільше з двох чисел.*/

int* more(int* a, int* b) {return ((*a) > (*b)) ? a : b;}

    /*Завдання 2. Використовуючи покажчики й оператор розі -
    менування, визначити знак числа, введеного з клавіатури.*/

void positiveOrNegative(int* a) {
    if (*a>=0)
    {
        cout << "Number is positive" << endl;
    }
    else
    {
        cout << "Number is negative" << endl;
    }
}

/*Завдання 3. Використовуючи покажчики й оператор роз -
        іменування, поміняти місцями значення двох змінних.*/

void changeVars(int* a, int* b) {
    int temp = *a;
    *a = *b;
    *b = temp;
}

/*Завдання 4. Написати примітивний калькулятор, кори -
    стуючись тільки покажчиками.*/

void calc(int* a,int* b, char* o){
    if ((*o)=='+')
    {
        cout << *a << *o << *b << " = " << *a + *b << endl;
    }
    else if ((*o) == '-')
    {
        cout << *a << *o << *b << " = " << *a - *b << endl;
    }
    else if ((*o) == '*')
    {
        cout << *a << *o << *b << " = " << *a * *b << endl;
    }
    else if ((*o) == '/')
    {
        cout << *a << *o << *b << " = " << *a / *b << endl;
    }
    else
    {
        cout << "Error" << endl;
    }
}

/*Завдання 5. Використовуючи покажчик на масив цілих
    чисел, порахувати суму елементів масиву.Використову -
    вати в програмі арифметику покажчиків для просування
    по масиву, а також оператор розіменування.*/


void sum(int* arr, int size) {
    int sum = 0;
    for (int i = 0; i < size; i++)
    {
        sum += *(arr + i);
    }
    cout << "Summa = " << sum << endl;
}




int main()
{
    /*Завдання 1. Використовуючи покажчики й оператор
    розіменування, визначити найбільше з двох чисел.*/

    int a = 5, b = 10;
    cout << *(more(&a, &b)) << endl;

    /*Завдання 2. Використовуючи покажчики й оператор розі -
        менування, визначити знак числа, введеного з клавіатури.*/


    cout << "enter number: " << endl;
    int c;
    cin >> c;
    positiveornegative(&c);

    /*Завдання 3. Використовуючи покажчики й оператор роз -
        іменування, поміняти місцями значення двох змінних.*/


    int a = 5, b = 10;
    cout << "a= " << a << " b= " << b << endl;
    changeVars(&a, &b);
    cout << "a= " << a << " b= " << b << endl;

    /*Завдання 4. Написати примітивний калькулятор, кори -
        стуючись тільки покажчиками.*/

    int a, b;
    char o;
    cout << "Enter 1 number, 2 number, operator:" << endl;
    cin >> a >> b >> o;
    calc(&a, &b, &o);

    /*Завдання 5. Використовуючи покажчик на масив цілих
        чисел, порахувати суму елементів масиву.Використову -
        вати в програмі арифметику покажчиків для просування
        по масиву, а також оператор розіменування.*/

    const int size = 5;
    int arr[size] = { 10,20,30,40,50 };
    sum(arr, size);




    
}

